// react function component
import React from 'react';
import { Link } from 'react-router-dom';
import NBEButton from '../../components/NBEButton/NBEButton';
import RegistrationElement from '../../components/RegistrationElement/RegistrationElement';
import { useSelector} from 'react-redux';


import './Registration.css';

/**
 الدعم الإداري
المنتجات و المبيعات
الخدمات المصرفية الرقمية
ضمان الجودة
مجموعة الموارد البشرية
General
الامن
Risk
تنفيذ ومتابعة الديون
مجموعة معالجة و إعادة هيكلة الديون الغير منتظمة
مخاطر المؤسسات المالية
تمويل الشركات الكبرى
SME
فروع
Treasury
المؤسسات المالية
الاستثمارات
الرقابه الداخليه
Audit
إجراءات التشغيل المعياريه
الالتزام المصرفي والحوكمه المؤسسيه
المجموعه القانونيه
Operation
اداره المشروعات
إجراءات التشغيل المعياريه لتكنولوجيا المعلومات
امن المعلومات
التدقيق و التقتيش على اعمال نظم المعلومات
مخاطر تشغيل المعلومات
حوكمه تكنولوجيا المعلومات
البحوث
الماليه
التخطيط الاستراتيجي
انظمه المعلومات و البنيه التحتيه
البنية التحيتة
التحديثات وادارة خدمات وتامين انظمة مايكروسفت
الحاسبات و نظم التشغيل ووحدات التخزين
الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات
الدعم الفنى للتطبيقات و قواعد البيانات
الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات
رقابة و تطوير و ادارة خدمات نظم المعلومات
مراكز التشغيل
سرية المعلومات ومواجهة المخاطر
Data Center
الشبكات و الاتصالات
الدعم الفني لماكينات الصارف الالى
هندسة انظمة الارشفه وهندسة تدفق العمليات
التصميمات والمخططات الهندسية
تكنولوجيا المعلومات و التطبيقات
المراقبة والسرية - مراقبة الانظمة
لمراقبة والسرية - مراكز الدعم الفنى والطوارىء
الانظمة الرئيسية - تطبيقات القروض والضمانات والمعاملات الاسلامية
الانظمة الرئيسية - تطبيقات اعمال التجارة
الانظمة الرئيسية - تطبيقات البيانات الاساسية والخصوم
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Production Support TEAM
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Implementation Team المراقبة والسرية - مكتب الخدمة وادارة الاحداث
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم ERP ADMIN TEAM تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم
تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Implementation Team تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Implementation Team
تحليل البيانات والبرامج الوسيطة - تحليل البيانات تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية"
البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم ERP ADMIN TEAM
البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقميةEbanking Support
البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Dev. – Web
البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Dev. – Web / لبرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Quality Control
لبرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Quality Control
المراقبة والسرية - سرية التطبيقات
المراقبة والسرية - مكتب الخدمة وادارة الاحداث
تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم
تحليل البيانات والبرامج الوسيطة - تحليل البيانات
 */

// make every element in the array unique from previous comment and add it to the selectList array 


const selectList1 = [  
    'General', 
    "الدعم الإداري",
    "المنتجات و المبيعات",
    "الخدمات المصرفية الرقمية",
    "ضمان الجودة",
    "مجموعة الموارد البشرية",
    "General",
    "الامن",
    "Risk",
    "تنفيذ ومتابعة الديون",
    "مجموعة معالجة و إعادة هيكلة الديون الغير منتظمة",
    "مخاطر المؤسسات المالية",
    "تمويل الشركات الكبرى",
    "SME",
    "فروع",
    "Treasury",
    "المؤسسات المالية",
    "الاستثمارات",
    "الرقابه الداخليه",
    "Audit",
    "إجراءات التشغيل المعياريه",
    "الالتزام المصرفي والحوكمه المؤسسيه",
    "المجموعه القانونيه",
    "Operation",
    "اداره المشروعات",
    "إجراءات التشغيل المعياريه لتكنولوجيا المعلومات",
    "امن المعلومات",
    "التدقيق و التقتيش على اعمال نظم المعلومات",
    "مخاطر تشغيل المعلومات",
    "حوكمه تكنولوجيا المعلومات",
    "البحوث",
    "الماليه",
    "التخطيط الاستراتيجي",
    "انظمه المعلومات و البنيه التحتيه",
    "البنية التحيتة",
    "التحديثات وادارة خدمات وتامين انظمة مايكروسفت",
    "الحاسبات و نظم التشغيل ووحدات التخزين",
    "الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات",
    "الدعم الفنى للتطبيقات و قواعد البيانات",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات",
    "رقابة و تطوير و ادارة خدمات نظم المعلومات",
    "مراكز التشغيل",
    "سرية المعلومات ومواجهة المخاطر",
    "Data Center",
    "الشبكات و الاتصالات",
    "الدعم الفني لماكينات الصارف الالى",
    "هندسة انظمة الارشفه وهندسة تدفق العمليات",
    "التصميمات والمخططات الهندسية",
    "تكنولوجيا المعلومات و التطبيقات",
    "المراقبة والسرية ",
    " مراقبة الانظمة",
    "لمراقبة والسرية ",
    "مراكز الدعم الفنى والطوارىء",
    "المراقبة والسرية - سرية التطبيقات",
    "المراقبة والسرية - مكتب الخدمة وادارة الاحداث",
    "تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم",
    "تحليل البيانات والبرامج الوسيطة - تحليل البيانات",
    "البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Dev. – Web",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Quality Control"
];




/** 
التامين المركزي
الحسابات و التعاقدات
الامدادات اللوجيستية
إدارة المخازن و المزادات
المصايف والرحلات
خدمات الفندقة و المطاعم
المنتجات و المبيعات
الخدمات المصرفية الرقمية
ضمان الجودة
المشروعات ومراقبة التنفيذ
مجموعة الموارد البشرية
General
الامن
مخاطر ائتمان الشركات الكبرى
تنفيذ ومتابعة الديون
مجموعة معالجة و إعادة هيكلة الديون الغير منتظمة
مخاطر المؤسسات المالية
مجموعة مخاطر السوق
مجموعة مخاطر التجزئة المصرفية
مجموعة مخاطر المشروعات الصغيرة والمتوسطة و مخاطر الشمول المالى
مجموعة مخاطر التشغيل
تمويل الشركات الكبرى
المشروعات الصغيرة والمتوسطة
فروع
الخزانة وأسواق المال
قطاع المعرفة و التطوير
قطاع التطوير المؤسسي
قطاع الأجور و المزايا
قطاع استقطاب الكفاءات
قطاع التطوير المؤسسي
المؤسسات المالية
الاستثمارات
قطاع استقطاب الكفاءات / قطاع شركاء الأعمال
قطاع تحليلات الموارد البشرية
الرقابه الداخليه
التدقيق على المركز الرئيسي
إجراءات التشغيل المعياريه
الالتزام المصرفي والحوكمه المؤسسيه
المجموعه القانونيه
الرقابه على الخزانه
اصدار الشهادات والودائع لاجل
عمليات الودائع والخصوم
المدفوعات وتحصيل الشيكات
الضمانات النقديه وتعليمات العملاء
الأوراق الماليه وعمليات أمناء الحفظ المركزي
النقد الضخم
الرقابه على النقد الضخم
عمليات القروض المشتركة ومراقبة عمليات خطابات الضمان والمزايا السعريه وقطاعات خطابات الضمان
الاعتمادات المستنديه
الاعتراضات وخدمة العملاء ومخزون البطاقات
التسويات والمدفوعات والحسابات الالكترونيه
مركز البطاقات ونظم الدفع الالكترونيه - المراجعه والتقارير
مركز البطاقات ونظم الدفع الالكترونيه - تسجيل ومعالجة البيانات والاصدارات
مركز البطاقات ونظم الدفع الالكترونيه - قنوات التوزيع
مركز البطاقات ونظم الدفع الالكترونيه
فتح وتحديث الحسابات
الصيانة وإدارة المنشآت
قطاع شركاء اعمال الموارد البشرية
اداره المشروعات
إجراءات التشغيل المعياريه لتكنولوجيا المعلومات
امن المعلومات
التدقيق و التقتيش على اعمال نظم المعلومات
مخاطر تشغيل المعلومات
حوكمه تكنولوجيا المعلومات
البحوث
الماليه
التخطيط الاستراتيجي
انظمه المعلومات و البنيه التحتيه
الدعم الفني لماكينات الصارف الالى
 */

// the previous comment should be an array of strings 
const selectList2 = [
    'General',
	'المنتجات و المبيعات',	
    'التامين المركزي',
    'الحسابات و التعاقدات',
    'الامدادات اللوجيستية',
    'إدارة المخازن و المزادات',
    'المصايف والرحلات',
    'خدمات الفندقة و المطاعم',
    'المنتجات و المبيعات',
    'الخدمات المصرفية الرقمية',
    'ضمان الجودة',
    'المشروعات ومراقبة التنفيذ',
    'مجموعة الموارد البشرية',
    'General',
    'الامن',
    'مخاطر ائتمان الشركات الكبرى',
    'تنفيذ ومتابعة الديون',
    'مجموعة معالجة و إعادة هيكلة الديون الغير منتظمة',
    'مخاطر المؤسسات المالية',
    'مجموعة مخاطر السوق',
    'مجموعة مخاطر التجزئة المصرفية',
    'مجموعة مخاطر المشروعات الصغيرة والمتوسطة و مخاطر الشمول المالى',
    'مجموعة مخاطر التشغيل',
    'تمويل الشركات الكبرى',
    'المشروعات الصغيرة والمتوسطة',
    'فروع',
    'الخزانة وأسواق المال',
    'قطاع المعرفة و التطوير',
    'قطاع التطوير المؤسسي',
    'قطاع الأجور و المزايا',
    'قطاع استقطاب الكفاءات',
    'قطاع التطوير المؤسسي',
    'المؤسسات المالية',
    'الاستثمارات',
    'قطاع استقطاب الكفاءات / قطاع شركاء الأعمال',
    'قطاع تحليلات الموارد البشرية',
    'الرقابه الداخليه',
    'التدقيق على المركز الرئيسي',
    'إجراءات التشغيل المعياريه',
    'الالتزام المصرفي والحوكمه المؤسسيه',
    'المجموعه القانونيه',
    'الرقابه على الخزانه',
    'اصدار الشهادات والودائع لاجل',
    'عمليات الودائع والخصوم',
    'المدفوعات وتحصيل الشيكات',
    'الضمانات النقديه وتعليمات العملاء',
    'الأوراق الماليه وعمليات أمناء الحفظ المركزي',
    'النقد الضخم',
    'الرقابه على النقد الضخم',
    'عمليات القروض المشتركة ومراقبة عمليات خطابات الضمان والمزايا السعريه وقطاعات خطابات الضمان',
    'الاعتمادات المستنديه',
    'الاعتراضات وخدمة العملاء ومخزون البطاقات',
    'التسويات والمدفوعات والحسابات الالكترونيه',
    'مركز البطاقات ونظم الدفع الالكترونيه - المراجعه والتقارير',
    'مركز البطاقات ونظم الدفع الالكترونيه - تسجيل ومعالجة البيانات والاصدارات',
    'مركز البطاقات ونظم الدفع الالكترونيه - قنوات التوزيع',
    'مركز البطاقات ونظم الدفع الالكترونيه',
    'فتح وتحديث الحسابات',
    'الصيانة وإدارة المنشآت',
    'قطاع شركاء اعمال الموارد البشرية',
    'اداره المشروعات',
    'إجراءات التشغيل المعياريه لتكنولوجيا المعلومات',
    'امن المعلومات',
    'التدقيق و التقتيش على اعمال نظم المعلومات',
    'مخاطر تشغيل المعلومات',
    'حوكمه تكنولوجيا المعلومات',
    'البحوث',
    'الماليه',
    'التخطيط الاستراتيجي',
    'انظمه المعلومات و البنيه التحتيه',
    'الدعم الفني لماكينات الصارف الالى'
];

/**
 مصرفى ا
مصرفي ب
مراقب
مصرفي ممتاز
نائب مدير إدارة
نائب مدير عام
مدير إدارة
نائب مدير
مدير عام
رئيس
 */
// nake array of previous comment 
const selectList3 = [
    'مصرفى ا',
    'مصرفي ب',
    'مراقب',
    'مصرفي ممتاز',
    'نائب مدير إدارة',
    'نائب مدير عام',
    'مدير إدارة',
    'نائب مدير',
    'مدير عام',
    'رئيس'
];

	

const registrationElements = [
	{
		number: '١',
		defaultText: 'اسم المجموعة',
		text: 'برجاء إختيار المجموعة',
		selectList: selectList1,
		nextChoice: 'sector'
	},
	{
		number: '٢',
		defaultText: 'اسم القطاع',
		text: 'برجاء إختيار القطاع',
		selectList: selectList2,
		nextChoice: 'jobLevel'
	},
	{
		number: '٣',
		defaultText: ' الدرجة الوظيفية',
		text: 'برجاء إختيار الدرجة الوظيفية',
		selectList: selectList3,
		nextChoice: 'jobLevel'
	}
];
/*
 redner every  element component(CONDETIONAL RENDERING) after select the group and the sector and the job level
 */

 /**
  * use RegistrationElement component to render the 3 elements
  make the 3rd element hidden until the user select the group and the sector
  make the 2nd element hidden until the user select the group
 */

  



function Registration() {
	
	const register = useSelector((state) => state.register);
	
	return (
		<div className="registration">
			<div className="registration__container">
				{/*loop over registrationElement */}
	
				<RegistrationElement
					defaultText={registrationElements[0].defaultText}
					number={registrationElements[0].number}
					text={registrationElements[0].text}
					selectList={registrationElements[0].selectList}
					nextChoice={registrationElements[0].nextChoice}
				/>

				{/* render the sector RegistrationElement when the register state = sector or jobLevel*/}
				{register.value.value === 'sector' || register.value.value === 'jobLevel' ? (
					<RegistrationElement
						defaultText={registrationElements[1].defaultText}
						number={registrationElements[1].number}
						text={registrationElements[1].text}
						selectList={registrationElements[1].selectList}
						nextChoice={registrationElements[1].nextChoice}
					/>
				) : null}

				{/* render the job level RegistrationElement when the register state = jobLevel */}
				{register.value.value === 'jobLevel' ? (
					<RegistrationElement
						defaultText={registrationElements[2].defaultText}
						number={registrationElements[2].number}
						text={registrationElements[2].text}
						selectList={registrationElements[2].selectList}
						nextChoice={registrationElements[2].nextChoice}
					/>
				) : null}


		
			</div>
            <Link to="/registerCompleted" className="registration__link">
                <NBEButton text="تسجيل" marginBottom ="-100p" />
            </Link>
		</div>
	);
}
export default Registration;
