export const levels = [
    'مصرفي ب',
    'مصرفي ا',
    'مصرفي ممتاز',
    'مراقب',
    'نائب مدير إدارة',
    'مدير إدارة',
    'نائب مدير عام',
    'مدير عام'
];

export const groups = ["التسويق والاتصال الخارجي",
"مجموعة الموارد البشرية",
"التجزئة المصرفية ( مركز رئيسى )",
"التنمية المجتمعية",
"الدعم الإداري",
"المؤسسات المالية",
"الاستثمارات",
"الخزانة وأسواق المال",
"المشروعات الصغيرة والمتوسطة",
"الشركات الكبرى و القروض المشتركة",
"الامن",
"مجموعة الفروع",
"تنفيذ ومتابعة الائتمان و الاستعلامات",
"مخاطر التجزئة المصرفية للافراد",
"مخاطر التشغيل",
"مخاطر السوق",
"مخاطر المشروعات الصغيرة والمتوسطة",
"مخاطر مشروعات الشمول المالى",
"معالجة و إعادة هيكلة الديون الغير منتظمة",
"مخاطر المؤسسات المالية و الدول و التمويل المستدام",
"مخاطر الائتمان المصرفي للشركات الكبرى",
"المجموعه القانونيه",
"قطاع الرقابه الداخليه",
"مجموعة الالتزام المصرفي والحوكمه المؤسسيه",
"مجموعة التدقيق الداخلي والتفتيش",
"مجموعة إجراءات التشغيل المعياريه",
"ادارة المشروعات PMO",
"استراتيجية وحوكمه تكنولوجيا المعلومات",
"الامن السيبرانى",
"البحوث",
"التخطيط الاستراتيجى",
"المجموعة المالية",
"انظمة المعلومات و البنية التحتية",
"تكنولوجيا المعلومات و التطبيقات",
"مجموعة العمليات"
]
export const units =  [
  [
    "العلاقات العامة",
    "الإدارة المالية",
    "التسويق الالكترونى و الرعاية",
    "الاتصال التسويقي",
    
  ],
  [
    
    "قطاع المعرفة و التطوير ",
    "قطاع الأجور  و المزايا",
    "قطاع استقطاب الكفاءات",
    "قطاع التطوير المؤسسي",
    "قطاع عمليات الوارد البشرية",
    "قطاع تحليلات الموارد البشرية",
    "قطاع شركاء اعمال الموارد البشرية",
    
  ],
  [
    
    "وحدة تطوير الإجراءات",
    "المنتجات و الشمول المالي",
    "الخدمات المصرفية الرقمية",
    "المبيعات و القنوات البديلة",
    "قطاع ضمان الجودة للفروع",
    "خدمة العملاء الهاتفية",
    "فحص الشكاوى",
    "التخطيط والتحليل والموازنة ",
    
  ],
  [
    
    "التنمية المجتمعية",
    
  ],
  [
    
    "المشروعات ومراقبة التنفيذ",
    "الصيانة وإدارة المنشآت ",
    "التأمين المركزى",
    " الحسابات و التعاقدات",
    "الامدادات اللوجيستية",
    "إدارة المخازن و المزادات",
    "المصايف والرحلات - خدمات الفندقة و المطاعم ",
    
  ],
  [
    
    "الخدمات المالية الدولية ",
    "المؤسسات المالية ",
    "تقييم وتحليل المؤسسات المالية ",
    
  ],
  [
    
    "الاستثمارات",
    "أمناء الاستثمار",
    "الحوكمة والرقتبة علي اعمال الاستثمارات وامناء الاستثمار ",
    
  ],
  [
    
    "مجموعة الخزانة",
    "مجموعة أسواق المال وخدمات أمناء الحفظ",
    
  ],
  [
    
    "برامج التمويل والشراكات المحلية",
    "دعم شرائح عملاء المشروعات الصغيرة والمتوسطة",
    "قطاع تنمية الاعمال",
    "قطاع التخطيط والتطوير",
    
  ],
  [
    
    "القروض المشتركة",
    "تمويل الشركات البترول",
    "الشركات المتوسطة و البرامج التمويلية",
    "الشركات الكبرى الكهرباء - البتروكيماويات والاتصالات",
    "الشركات الكبرى – مواد البناء ,الخدمي",
    "الشركات المحلية ومتعددة الجنسيات والمنتجات المصرفية",
    "تمويل الشركات الإسكندرية",
    "الشركات الكبرى المقاولات والسياحة والعقارات والنقل",
    "تمويل الشركات المتوسطة",
    
  ],
  [
    
    "الامن",
    
  ],
  [
    
    "خدمة العملاء والاستقبال",
    "خدمة عملاء البلاتينيوم ",
    "التللرات والخزينة ",
    "العمليات ",
    "المراجعة والالتزام ",
    "مديري الفروع",
    
  ],
  [
    
    " تنفيذ ومتابعة الائتمان ",
    "الاستعلامات",
    
  ],
  [
    
    "مخاطر التجزئة المصرفية للافراد",
    
  ],
  [
    
    "مخاطر التشغيل",
    
  ],
  [
    
    " مخاطر السوق",
    
  ],
  [
    
    "مخاطر المشروعات الصغيرة والمتوسطة  ",
    
  ],
  [
    
    "مخاطر مشروعات الشمول المالى",
    
  ],
  [
    
    " معالجة و إعادة هيكلة الديون الغير منتظمة",
    
  ],
  [
    
    "مخاطر المؤسسات المالية و الدول و التمويل المستدام",
    
  ],
  [
    
    "مخاطر  الائتمان المصرفي للشركات الكبرى",
    "قطاع إدارة المحفظة و مناهج قياس المخاطر",
    "قطاع السياسات الائتمانية",
    
  ],
  [
    
    "المجموعه القانونيه",
    
  ],
  [
    
    "قطاع الرقابه الداخليه ",
    
  ],
  [
    
    "مجموعة الالتزام المصرفي والحوكمه المؤسسيه",
    
  ],
  [
    
    "قطاع التدقيق على المركز الرئيسي",
    "قطاع التدقيق على ائتمان المشروعات الصغيره والمتوسطه ",
    "قطاع التفتيش ",
    "قطاع الجوده والتقارير ",
    "قطلع التدقيق على ائتمان المركز الرئيسي والاستثمارات ",
    
  ],
  [
    
    "مجموعة إجراءات التشغيل المعياريه",
    "قطاع اجراءات التشغيل المعيارية لتكنولوجيا المعلومات",
    
  ],
  [
    
    "ادارة المشروعات PMO",
    
  ],
  [
    
    "استراتيجية وحوكمه تكنولوجيا المعلومات",
    
  ],
  [
    
    "الامن السيبرانى",
    
  ],
  [
    
    "البحوث",
    
  ],
  [
    
    "التخطيط الاستراتيجى",
    
  ],
  [
    
    "التدقيق والتقتيش على اعمال نظم المعلومات",
    
  ],
  [
    
    "المجموعة المالية",
    
  ],
  [
    
    "Data Center",
    "البنية التحتية",
    "التحديثات وادارة خدمات وتامين انظمة مايكروسفت",
    "التصميمات والمخططات الهندسية",
    "الحاسبات و نظم التشغيل ووحدات التخزين",
    "الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات",
    "الدعم الفنى للتطبيقات و قواعد البيانات",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات - IMP Essentis",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات DEV ATM",
    "الدعم الفني لماكينات الصارف الالى ",
    "الشبكات و الاتصالات",
    "رقابة و تطوير و ادارة خدمات نظم المعلومات",
    "سرية المعلومات ومواجهة المخاطر",
    "مراكز التشغيل",
    "هندسة انظمة الارشفه وهندسة تدفق العمليات",
    
  ],
  [
    
    "  تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية",
    " المراقبة والسرية - مكتب الخدمة وادارة الاحداث",
    "الانظمة الرئيسية -  تطبيقات اعمال التجارة",
    "الانظمة الرئيسية - تطبيقات البيانات الاساسية والخصوم",
    "الانظمة الرئيسية - تطبيقات القروض والضمانات والمعاملات الاسلامية",
    "البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم   ERP ADMIN TEAM  ",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم   Implementation  Team ",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Production Support TEAM",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Dev. – Web",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Quality  Control",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقميةEbanking Support",
    "المراقبة والسرية - سرية التطبيقات",
    "المراقبة والسرية - مراقبة الانظمة",
    "المراقبة والسرية - مراكز الدعم الفنى والطوارىء",
    "تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم",
    "تحليل البيانات والبرامج الوسيطة - تحليل البيانات ",
    
  ],
  [
    
    "قطاع المخاطر المعلوماتية والسيبرانية وخصوصية البيانات",
    
  ],
  [
    
    "البنية التحيتة",
    
  ],
  [
    
    "مركز البطاقات ونظم الدفع الالكترونيه - تسجيل ومعالجة البيانات والاصدارات",
    "اصدار الشهادات والودائع لاجل ",
    "الاعتراضات وخدمة العملاء ومخزون البطاقات",
    "الضمانات النقديه وتعليمات العملاء",
    "المدفوعات وتحصيل الشيكات",
    "عمليات الودائع والخصوم",
    "مركز البطاقات ونظم الدفع الالكترونيه ",
    "مركز البطاقات ونظم الدفع الالكترونيه - المراجعه والتقارير",
    "مركز البطاقات ونظم الدفع الالكترونيه - قنوات التوزيع",
    "قطاع اصدار الشهادات والودائع لاجل ",
    "قطاع الاعتمادات المستنديه ",
    "قطاع الأوراق الماليه وعمليات أمناء الحفظ المركزي ",
    "قطاع التحصيلات المستنديه ",
    "قطاع الرقابه على اداره النقد ",
    "قطاع الرقابه على الخزانه ",
    "قطاع الضمانات النقديه وتعليمات العملاء ",
    "قطاع المدفوعات وتحصيل الشيكات ",
    "قطاع النقد الضخم ",
    "قطاع الودائع والخصوم ",
    "قطاع دعم العمليات ",
    "قطاع عمليات الخزانه ",
    "قطاع عمليات القروض المشتركة ومراقبة عمليات خطابات الضمان والمزايا السعريه وقطاعات خطابات الضمان",
    "قطاع فتح وتحديث الحسابات ",
    "مركز البطاقات ونظم الدفع الالكترونيه قطاع الاعتراضات وخدمة العملاء ومخزون البطاقات ",
    "مركز البطاقات ونظم الدفع الالكترونيه قطاع التسويات والمدفوعات والحسابات الالكترونيه ",
    "مركز البطاقات ونظم الدفع الالكترونيه قطاع المراجعه والتقارير ",
    "مركز البطاقات ونظم الدفع الالكترونيه قطاع قنوات التوزيع ",
    "مركز البطاقات ونظم الدفع الالكترونيه قطاع نظم الدفع ",
    "مركز البطاقات ونظم الدفع قطاع تسجيل ومعالجة البيانات والاصدارات ",
    
  ]
]

export const departments = {
	"التسويق والاتصال الخارجي": ["العلاقات العامة", "الإدارة المالية", "التسويق الالكترونى و الرعاية", "الاتصال التسويقي"],
	"مجموعة الموارد البشرية": [ "قطاع المعرفة و التطوير ", "قطاع الأجور  و المزايا", "قطاع استقطاب الكفاءات", "قطاع التطوير المؤسسي", "قطاع عمليات الوارد البشرية", "قطاع تحليلات الموارد البشرية", "قطاع شركاء اعمال الموارد البشرية"],
	"التجزئة المصرفية ( مركز رئيسى )": [ "وحدة تطوير الإجراءات", "المنتجات و الشمول المالي", "الخدمات المصرفية الرقمية", "المبيعات و القنوات البديلة", "قطاع ضمان الجودة للفروع", "خدمة العملاء الهاتفية", "فحص الشكاوى", "التخطيط والتحليل والموازنة "],
	"التنمية المجتمعية": [ "التنمية المجتمعية"],
	"الدعم الإداري": [ "المشروعات ومراقبة التنفيذ", "الصيانة وإدارة المنشآت ", "التأمين المركزى", " الحسابات و التعاقدات", "الامدادات اللوجيستية", "إدارة المخازن و المزادات", "المصايف والرحلات - خدمات الفندقة و المطاعم "],
	"المؤسسات المالية": [ "الخدمات المالية الدولية ", "المؤسسات المالية ", "تقييم وتحليل المؤسسات المالية "],
	"الاستثمارات": [ "الاستثمارات", "أمناء الاستثمار", "الحوكمة والرقتبة علي اعمال الاستثمارات وامناء الاستثمار "],
	"الخزانة وأسواق المال": [ "مجموعة الخزانة", "مجموعة أسواق المال وخدمات أمناء الحفظ"],
	"المشروعات الصغيرة والمتوسطة": [ "برامج التمويل والشراكات المحلية", "دعم شرائح عملاء المشروعات الصغيرة والمتوسطة", "قطاع تنمية الاعمال", "قطاع التخطيط والتطوير"],
	"الشركات الكبرى و القروض المشتركة": [ "القروض المشتركة", "تمويل الشركات البترول", "الشركات المتوسطة و البرامج التمويلية", "الشركات الكبرى الكهرباء - البتروكيماويات والاتصالات", "الشركات الكبرى – مواد البناء ,الخدمي", "الشركات المحلية ومتعددة الجنسيات والمنتجات المصرفية", "تمويل الشركات الإسكندرية", "الشركات الكبرى المقاولات والسياحة والعقارات والنقل", "تمويل الشركات المتوسطة"],
	"الامن": [ "الامن"],
	"مجموعة الفروع": [ "خدمة العملاء والاستقبال", "خدمة عملاء البلاتينيوم ", "التللرات والخزينة ", "العمليات ", "المراجعة والالتزام ", "مديري الفروع"],
	"تنفيذ ومتابعة الائتمان و الاستعلامات": [ " تنفيذ ومتابعة الائتمان ", "الاستعلامات"],
	"مخاطر التجزئة المصرفية للافراد": [ "مخاطر التجزئة المصرفية للافراد"],
	"مخاطر التشغيل": [ "مخاطر التشغيل" , "قطاع المخاطر المعلوماتية والسيبرانية وخصوصية البيانات"],
	"مخاطر السوق": [ " مخاطر السوق"],
	"مخاطر المشروعات الصغيرة والمتوسطة": [ "مخاطر المشروعات الصغيرة والمتوسطة  "],
	"مخاطر مشروعات الشمول المالى": [ "مخاطر مشروعات الشمول المالى"],
	"معالجة و إعادة هيكلة الديون الغير منتظمة": [ " معالجة و إعادة هيكلة الديون الغير منتظمة"],
	"مخاطر المؤسسات المالية و الدول و التمويل المستدام": [ "مخاطر المؤسسات المالية و الدول و التمويل المستدام"],
	"مخاطر الائتمان المصرفي للشركات الكبرى": [ "مخاطر  الائتمان المصرفي للشركات الكبرى", "قطاع إدارة المحفظة و مناهج قياس المخاطر", "قطاع السياسات الائتمانية"],
	"المجموعه القانونيه": [ "المجموعه القانونيه"],
	"قطاع الرقابه الداخليه": [ "قطاع الرقابه الداخليه "],
	"مجموعة الالتزام المصرفي والحوكمه المؤسسيه": [ "مجموعة الالتزام المصرفي والحوكمه المؤسسيه"],
	"مجموعة التدقيق الداخلي والتفتيش": [ "قطاع التدقيق على المركز الرئيسي", "قطاع التدقيق على ائتمان المشروعات الصغيره والمتوسطه ", "قطاع التفتيش ", "قطاع الجوده والتقارير ", "قطلع التدقيق على ائتمان المركز الرئيسي والاستثمارات "],
	"مجموعة إجراءات التشغيل المعياريه": [ "مجموعة إجراءات التشغيل المعياريه", "قطاع اجراءات التشغيل المعيارية لتكنولوجيا المعلومات"],
	"ادارة المشروعات PMO": [ "ادارة المشروعات PMO"],
	"استراتيجية وحوكمه تكنولوجيا المعلومات": [ "استراتيجية وحوكمه تكنولوجيا المعلومات"],
	"الامن السيبرانى": [ "الامن السيبرانى"],
	"البحوث": [ "البحوث"],
	"التخطيط الاستراتيجى": [ "التخطيط الاستراتيجى"],
	"المجموعة المالية": [ "التدقيق والتقتيش على اعمال نظم المعلومات"],
	"انظمة المعلومات و البنية التحتية": [
        "Data Center",
        "البنية التحتية",
        "التحديثات وادارة خدمات وتامين انظمة مايكروسفت",
        "التصميمات والمخططات الهندسية",
        "الحاسبات و نظم التشغيل ووحدات التخزين",
        "الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات",
        "الدعم الفنى للتطبيقات و قواعد البيانات",
        "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات",
        "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات - IMP Essentis",
        "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات DEV ATM",
        "الدعم الفني لماكينات الصارف الالى",
        "الشبكات و الاتصالات",
        "رقابة و تطوير و ادارة خدمات نظم المعلومات",
        "سرية المعلومات ومواجهة المخاطر",
        "مراكز التشغيل",
        "هندسة انظمة الارشفه وهندسة تدفق العمليات"
      ],
	"تكنولوجيا المعلومات و التطبيقات": [
        "تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية",
        "المراقبة والسرية - مكتب الخدمة وادارة الاحداث",
        "الانظمة الرئيسية -  تطبيقات اعمال التجارة",
        "الانظمة الرئيسية - تطبيقات البيانات الاساسية والخصوم",
        "الانظمة الرئيسية - تطبيقات القروض والضمانات والمعاملات الاسلامية",
        "البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة",
        "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم   ERP ADMIN TEAM",
        "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم   Implementation  Team",
        "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Production Support TEAM",
        "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Dev. – Web",
        "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Quality  Control",
        "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقميةEbanking Support",
        "المراقبة والسرية - سرية التطبيقات",
        "المراقبة والسرية - مراقبة الانظمة",
        "المراقبة والسرية - مراكز الدعم الفنى والطوارىء",
        "تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم",
        "تحليل البيانات والبرامج الوسيطة - تحليل البيانات"
      ],
	"مجموعة العمليات": [
        "مركز البطاقات ونظم الدفع الالكترونيه - تسجيل ومعالجة البيانات والاصدارات",
        "اصدار الشهادات والودائع لاجل",
        "الاعتراضات وخدمة العملاء ومخزون البطاقات",
        "الضمانات النقديه وتعليمات العملاء",
        "المدفوعات وتحصيل الشيكات",
        "عمليات الودائع والخصوم",
        "مركز البطاقات ونظم الدفع الالكترونيه",
        "مركز البطاقات ونظم الدفع الالكترونيه - المراجعه والتقارير",
        "مركز البطاقات ونظم الدفع الالكترونيه - قنوات التوزيع",
        "قطاع اصدار الشهادات والودائع لاجل",
        "قطاع الاعتمادات المستنديه",
        "قطاع الأوراق الماليه وعمليات أمناء الحفظ المركزي",
        "قطاع التحصيلات المستنديه",
        "قطاع الرقابه على اداره النقد",
        "قطاع الرقابه على الخزانه",
        "قطاع الضمانات النقديه وتعليمات العملاء",
        "قطاع المدفوعات وتحصيل الشيكات",
        "قطاع النقد الضخم",
        "قطاع الودائع والخصوم",
        "قطاع دعم العمليات",
        "قطاع عمليات الخزانه",
        "قطاع عمليات القروض المشتركة ومراقبة عمليات خطابات الضمان والمزايا السعريه وقطاعات خطابات الضمان",
        "قطاع فتح وتحديث الحسابات",
        "مركز البطاقات ونظم الدفع الالكترونيه قطاع الاعتراضات وخدمة العملاء ومخزون البطاقات",
        "مركز البطاقات ونظم الدفع الالكترونيه قطاع التسويات والمدفوعات والحسابات الالكترونيه",
        "مركز البطاقات ونظم الدفع الالكترونيه قطاع المراجعه والتقارير",
        "مركز البطاقات ونظم الدفع الالكترونيه قطاع قنوات التوزيع",
        "مركز البطاقات ونظم الدفع الالكترونيه قطاع نظم الدفع",
        "مركز البطاقات ونظم الدفع قطاع تسجيل ومعالجة البيانات والاصدارات"
    ]
}