export const levels = [
  "مصرفي ب",
  "مصرفي ا",
  "مصرفي ممتاز",
  "مراقب",
  "نائب مدير إدارة",
  "مدير إدارة",
  "نائب مدير عام",
  "مدير عام"
]
export const groups = [
  "تنفيذ ومتابعة الائتمان و الاستعلامات",
  "مخاطر السوق",
  "معالجة و إعادة هيكلة الديون الغير منتظمة",
  "مخاطر  الائتمان المصرفي للشركات الكبرى",
  "مخاطر التجزئة المصرفية للافراد",
  "مخاطر التشغيل",
  "مخاطر المشروعات الصغيرة والمتوسطة",
  "مخاطر المؤسسات المالية و الدول و التمويل المستدام",
  "مخاطر مشروعات الشمول المالى",
  "ادارة المشروعات PMO",
  "استراتيجية وحوكمه تكنولوجيا المعلومات",
  "الامن السيبرانى",
  "البحوث",
  "التخطيط الاستراتيجى",
  "المجموعة المالية",
  "انظمة المعلومات و البنية التحتية",
  "تكنولوجيا المعلومات و التطبيقات",
  "مجموعة التدقيق الداخلي والتفتيش",
  "مجموعة إجراءات التشغيل المعياريه",
  "مجموعة العمليات",
  "قطاع الرقابه الداخليه",
  "الدعم الإداري",
  "الاستثمارات",
  "الامن",
  "التجزئة المصرفية ( مركز رئيسى )",
  "التسويق والاتصال الخارجي",
  "التنمية المجتمعية",
  "الخزانة وأسواق المال",
  "الشركات الكبرى و القروض المشتركة",
  "المجموعه القانونيه",
  "المشروعات الصغيرة والمتوسطة",
  "المؤسسات المالية",
  "مجموعة الالتزام المصرفي والحوكمه المؤسسيه",
  "مجموعة الفروع",
  "مجموعة الموارد البشرية"
]
export const units = [
  "تنفيذ ومتابعة الائتمان",
  "الاستعلامات",
  "مخاطر السوق",
  "معالجة و إعادة هيكلة الديون الغير منتظمة",
  "قطاع السياسات الائتمانية",
  "قطاع إدارة المحفظة و مناهج قياس المخاطر",
  "مخاطر  الائتمان المصرفي للشركات الكبرى",
  "مخاطر التجزئة المصرفية للافراد",
  "مخاطر التشغيل",
  "مخاطر المشروعات الصغيرة والمتوسطة",
  "مخاطر المؤسسات المالية و الدول و التمويل المستدام",
  "مخاطر مشروعات الشمول المالى",
  "ادارة المشروعات PMO",
  "استراتيجية وحوكمه تكنولوجيا المعلومات",
  "الامن السيبرانى",
  "البحوث",
  "التخطيط الاستراتيجى",
  "المجموعة المالية",
  "Data Center",
  "البنية التحتية",
  "التحديثات وادارة خدمات وتامين انظمة مايكروسفت",
  "التصميمات والمخططات الهندسية",
  "الحاسبات و نظم التشغيل ووحدات التخزين",
  "الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات",
  "الدعم الفنى للتطبيقات و قواعد البيانات",
  "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات",
  "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات - IMP Essentis",
  "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات DEV ATM",
  "الدعم الفني لماكينات الصارف الالى",
  "الشبكات و الاتصالات",
  "رقابة و تطوير و ادارة خدمات نظم المعلومات",
  "سرية المعلومات ومواجهة المخاطر",
  "مراكز التشغيل",
  "هندسة انظمة الارشفه وهندسة تدفق العمليات",
  "تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية",
  "المراقبة والسرية - مكتب الخدمة وادارة الاحداث",
  "الانظمة الرئيسية -  تطبيقات اعمال التجارة",
  "الانظمة الرئيسية - تطبيقات البيانات الاساسية والخصوم",
  "الانظمة الرئيسية - تطبيقات القروض والضمانات والمعاملات الاسلامية",
  "البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة",
  "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم ERP ADMIN TEAM",
  "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم   Implementation  Team",
  "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Production Support TEAM",
  "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Dev. – Web",
  "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Quality  Control",
  "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقميةEbanking Support",
  "المراقبة والسرية - سرية التطبيقات",
  "المراقبة والسرية - مراقبة الانظمة",
  "المراقبة والسرية - مراكز الدعم الفنى والطوارىء",
  "تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم",
  "تحليل البيانات والبرامج الوسيطة - تحليل البيانات",
  "التدقيق والتقتيش على اعمال نظم المعلومات",
  "قطاع اجراءات التشغيل المعيارية لتكنولوجيا المعلومات",
  "قطاع المخاطر المعلوماتية والسيبرانية وخصوصية البيانات",
  "مركز البطاقات ونظم الدفع الالكترونيه - المراجعه والتقارير",
  "قطاع الرقابه الداخليه",
  "الحسابات و التعاقدات",
  "الامدادات اللوجيستية",
  "التأمين المركزى",
  "الصيانة وإدارة المنشآت",
  "المشروعات ومراقبة التنفيذ",
  "المصايف والرحلات - خدمات الفندقة و المطاعم",
  "إدارة المخازن و المزادات",
  "الاستثمارات",
  "الحوكمة والرقتبة علي اعمال الاستثمارات وامناء الاستثمار",
  "أمناء الاستثمار",
  "الامن",
  "التخطيط والتحليل والموازنة",
  "الخدمات المصرفية الرقمية",
  "المبيعات و القنوات البديلة",
  "المنتجات و الشمول المالي",
  "خدمة العملاء الهاتفية",
  "فحص الشكاوى",
  "قطاع ضمان الجودة للفروع",
  "وحدة تطوير الإجراءات",
  "الاتصال التسويقي",
  "الإدارة المالية",
  "التسويق الالكترونى و الرعاية",
  "العلاقات العامة",
  "التنمية المجتمعية",
  "مجموعة الخزانة",
  "مجموعة أسواق المال وخدمات أمناء الحفظ",
  "الشركات الكبرى – مواد البناء ,الخدمي",
  "الشركات الكبرى الكهرباء - البتروكيماويات والاتصالات",
  "الشركات الكبرى المقاولات والسياحة والعقارات والنقل",
  "الشركات المتوسطة و البرامج التمويلية",
  "الشركات المحلية ومتعددة الجنسيات والمنتجات المصرفية",
  "القروض المشتركة",
  "تمويل الشركات الإسكندرية",
  "تمويل الشركات البترول",
  "تمويل الشركات المتوسطة",
  "المجموعه القانونيه",
  "برامج التمويل والشراكات المحلية",
  "دعم شرائح عملاء المشروعات الصغيرة والمتوسطة",
  "قطاع التخطيط والتطوير",
  "قطاع تنمية الاعمال",
  "الخدمات المالية الدولية",
  "المؤسسات المالية",
  "تقييم وتحليل المؤسسات المالية",
  "مجموعة الالتزام المصرفي والحوكمه المؤسسيه",
  "التدقيق على المركز الرئيسي",
  "التدقيق على ائتمان المركز الرئيسي والاستثمارات",
  "التدقيق على ائتمان المشروعات الصغيره والمتوسطه",
  "التفتيش",
  "الجوده والتقارير",
  "الاعتمادات المستنديه",
  "اصدار الشهادات والودائع لاجل",
  "الأوراق الماليه وعمليات أمناء الحفظ المركزي",
  "التحصيلات المستنديه",
  "الرقابه على اداره النقد",
  "الرقابه على الخزانه",
  "الضمانات النقديه وتعليمات العملاء",
  "المدفوعات وتحصيل الشيكات",
  "النقد الضخم",
  "الودائع والخصوم",
  "دعم العمليات",
  "عمليات الخزانه",
  "عمليات القروض المشتركة ومراقبة عمليات خطابات الضمان والمزايا السعريه وقطاعات خطابات الضمان",
  "فتح وتحديث الحسابات",
  "مركز البطاقات ونظم الدفع الالكترونيه - الاعتراضات وخدمة العملاء ومخزون البطاقات",
  "مركز البطاقات ونظم الدفع الالكترونيه - التسويات والمدفوعات والحسابات الالكترونيه",
  "مركز البطاقات ونظم الدفع الالكترونيه - تسجيل ومعالجة البيانات والاصدارات",
  "مركز البطاقات ونظم الدفع الالكترونيه - قنوات التوزيع",
  "مركز البطاقات ونظم الدفع الالكترونيه - نظم الدفع",
  "التللرات والخزينة",
  "العمليات",
  "المراجعة والالتزام",
  "خدمة العملاء والاستقبال",
  "خدمة عملاء البلاتينيوم",
  "مديري الفروع",
  "قطاع ادارة الاداء",
  "قطاع ادارة الكفاءات",
  "قطاع استقطاب الكفاءات",
  "قطاع الاتصال الداخلى",
  "قطاع الأجور  و المزايا",
  "قطاع التطوير المؤسسي",
  "قطاع المعرفة و التطوير",
  "قطاع تحليلات الموارد البشرية",
  "قطاع شركاء اعمال الموارد البشرية",
  "قطاع عمليات الوارد البشرية",
  "مجموعة إجراءات التشغيل المعياريه"
]
export const departments = {
  "تنفيذ ومتابعة الائتمان و الاستعلامات": [
    "تنفيذ ومتابعة الائتمان",
    "الاستعلامات"
  ],
  "مخاطر السوق": [
    "مخاطر السوق"
  ],
  "معالجة و إعادة هيكلة الديون الغير منتظمة": [
    "معالجة و إعادة هيكلة الديون الغير منتظمة"
  ],
  "مخاطر  الائتمان المصرفي للشركات الكبرى": [
    "قطاع السياسات الائتمانية",
    "قطاع إدارة المحفظة و مناهج قياس المخاطر",
    "مخاطر  الائتمان المصرفي للشركات الكبرى"
  ],
  "مخاطر التجزئة المصرفية للافراد": [
    "مخاطر التجزئة المصرفية للافراد"
  ],
  "مخاطر التشغيل": [
    "مخاطر التشغيل",
    "قطاع المخاطر المعلوماتية والسيبرانية وخصوصية البيانات"
  ],
  "مخاطر المشروعات الصغيرة والمتوسطة": [
    "مخاطر المشروعات الصغيرة والمتوسطة"
  ],
  "مخاطر المؤسسات المالية و الدول و التمويل المستدام": [
    "مخاطر المؤسسات المالية و الدول و التمويل المستدام"
  ],
  "مخاطر مشروعات الشمول المالى": [
    "مخاطر مشروعات الشمول المالى"
  ],
  "ادارة المشروعات PMO": [
    "ادارة المشروعات PMO"
  ],
  "استراتيجية وحوكمه تكنولوجيا المعلومات": [
    "استراتيجية وحوكمه تكنولوجيا المعلومات"
  ],
  "الامن السيبرانى": [
    "الامن السيبرانى"
  ],
  "البحوث": [
    "البحوث"
  ],
  "التخطيط الاستراتيجى": [
    "التخطيط الاستراتيجى"
  ],
  "المجموعة المالية": [
    "المجموعة المالية"
  ],
  "انظمة المعلومات و البنية التحتية": [
    "Data Center",
    "البنية التحتية",
    "التحديثات وادارة خدمات وتامين انظمة مايكروسفت",
    "التصميمات والمخططات الهندسية",
    "الحاسبات و نظم التشغيل ووحدات التخزين",
    "الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات",
    "الدعم الفنى للتطبيقات و قواعد البيانات",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات - IMP Essentis",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات DEV ATM",
    "الدعم الفني لماكينات الصارف الالى",
    "الشبكات و الاتصالات",
    "رقابة و تطوير و ادارة خدمات نظم المعلومات",
    "سرية المعلومات ومواجهة المخاطر",
    "مراكز التشغيل",
    "هندسة انظمة الارشفه وهندسة تدفق العمليات"
  ],
  "تكنولوجيا المعلومات و التطبيقات": [
    "تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية",
    "المراقبة والسرية - مكتب الخدمة وادارة الاحداث",
    "الانظمة الرئيسية -  تطبيقات اعمال التجارة",
    "الانظمة الرئيسية - تطبيقات البيانات الاساسية والخصوم",
    "الانظمة الرئيسية - تطبيقات القروض والضمانات والمعاملات الاسلامية",
    "البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم ERP ADMIN TEAM",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم   Implementation  Team",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Production Support TEAM",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Dev. – Web",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية  Quality  Control",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقميةEbanking Support",
    "المراقبة والسرية - سرية التطبيقات",
    "المراقبة والسرية - مراقبة الانظمة",
    "المراقبة والسرية - مراكز الدعم الفنى والطوارىء",
    "تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم",
    "تحليل البيانات والبرامج الوسيطة - تحليل البيانات"
  ],
  "مجموعة التدقيق الداخلي والتفتيش": [
    "التدقيق والتقتيش على اعمال نظم المعلومات",
    "التدقيق على المركز الرئيسي",
    "التدقيق على ائتمان المركز الرئيسي والاستثمارات",
    "التدقيق على ائتمان المشروعات الصغيره والمتوسطه",
    "التفتيش",
    "الجوده والتقارير"
  ],
  "مجموعة إجراءات التشغيل المعياريه": [
    "قطاع اجراءات التشغيل المعيارية لتكنولوجيا المعلومات",
    "مجموعة إجراءات التشغيل المعياريه"
  ],
  "مجموعة العمليات": [
    "مركز البطاقات ونظم الدفع الالكترونيه - المراجعه والتقارير",
    "الاعتمادات المستنديه",
    "اصدار الشهادات والودائع لاجل",
    "الأوراق الماليه وعمليات أمناء الحفظ المركزي",
    "التحصيلات المستنديه",
    "الرقابه على اداره النقد",
    "الرقابه على الخزانه",
    "الضمانات النقديه وتعليمات العملاء",
    "المدفوعات وتحصيل الشيكات",
    "النقد الضخم",
    "الودائع والخصوم",
    "دعم العمليات",
    "عمليات الخزانه",
    "عمليات القروض المشتركة ومراقبة عمليات خطابات الضمان والمزايا السعريه وقطاعات خطابات الضمان",
    "فتح وتحديث الحسابات",
    "مركز البطاقات ونظم الدفع الالكترونيه - الاعتراضات وخدمة العملاء ومخزون البطاقات",
    "مركز البطاقات ونظم الدفع الالكترونيه - التسويات والمدفوعات والحسابات الالكترونيه",
    "مركز البطاقات ونظم الدفع الالكترونيه - تسجيل ومعالجة البيانات والاصدارات",
    "مركز البطاقات ونظم الدفع الالكترونيه - قنوات التوزيع",
    "مركز البطاقات ونظم الدفع الالكترونيه - نظم الدفع"
  ],
  "قطاع الرقابه الداخليه": [
    "قطاع الرقابه الداخليه"
  ],
  "الدعم الإداري": [
    "الحسابات و التعاقدات",
    "الامدادات اللوجيستية",
    "التأمين المركزى",
    "الصيانة وإدارة المنشآت",
    "المشروعات ومراقبة التنفيذ",
    "المصايف والرحلات - خدمات الفندقة و المطاعم",
    "إدارة المخازن و المزادات"
  ],
  "الاستثمارات": [
    "الاستثمارات",
    "الحوكمة والرقتبة علي اعمال الاستثمارات وامناء الاستثمار",
    "أمناء الاستثمار"
  ],
  "الامن": [
    "الامن"
  ],
  "التجزئة المصرفية ( مركز رئيسى )": [
    "التخطيط والتحليل والموازنة",
    "الخدمات المصرفية الرقمية",
    "المبيعات و القنوات البديلة",
    "المنتجات و الشمول المالي",
    "خدمة العملاء الهاتفية",
    "فحص الشكاوى",
    "قطاع ضمان الجودة للفروع",
    "وحدة تطوير الإجراءات"
  ],
  "التسويق والاتصال الخارجي": [
    "الاتصال التسويقي",
    "الإدارة المالية",
    "التسويق الالكترونى و الرعاية",
    "العلاقات العامة"
  ],
  "التنمية المجتمعية": [
    "التنمية المجتمعية"
  ],
  "الخزانة وأسواق المال": [
    "مجموعة الخزانة",
    "مجموعة أسواق المال وخدمات أمناء الحفظ"
  ],
  "الشركات الكبرى و القروض المشتركة": [
    "الشركات الكبرى – مواد البناء ,الخدمي",
    "الشركات الكبرى الكهرباء - البتروكيماويات والاتصالات",
    "الشركات الكبرى المقاولات والسياحة والعقارات والنقل",
    "الشركات المتوسطة و البرامج التمويلية",
    "الشركات المحلية ومتعددة الجنسيات والمنتجات المصرفية",
    "القروض المشتركة",
    "تمويل الشركات الإسكندرية",
    "تمويل الشركات البترول",
    "تمويل الشركات المتوسطة"
  ],
  "المجموعه القانونيه": [
    "المجموعه القانونيه"
  ],
  "المشروعات الصغيرة والمتوسطة": [
    "برامج التمويل والشراكات المحلية",
    "دعم شرائح عملاء المشروعات الصغيرة والمتوسطة",
    "قطاع التخطيط والتطوير",
    "قطاع تنمية الاعمال"
  ],
  "المؤسسات المالية": [
    "الخدمات المالية الدولية",
    "المؤسسات المالية",
    "تقييم وتحليل المؤسسات المالية"
  ],
  "مجموعة الالتزام المصرفي والحوكمه المؤسسيه": [
    "مجموعة الالتزام المصرفي والحوكمه المؤسسيه"
  ],
  "مجموعة الفروع": [
    "التللرات والخزينة",
    "العمليات",
    "المراجعة والالتزام",
    "خدمة العملاء والاستقبال",
    "خدمة عملاء البلاتينيوم",
    "مديري الفروع"
  ],
  "مجموعة الموارد البشرية": [
    "قطاع ادارة الاداء",
    "قطاع ادارة الكفاءات",
    "قطاع استقطاب الكفاءات",
    "قطاع الاتصال الداخلى",
    "قطاع الأجور  و المزايا",
    "قطاع التطوير المؤسسي",
    "قطاع المعرفة و التطوير",
    "قطاع تحليلات الموارد البشرية",
    "قطاع شركاء اعمال الموارد البشرية",
    "قطاع عمليات الوارد البشرية"
  ]
}