export const levels = [
  "مصرفى ب",
  "مصرفي ا",
  "مصرفي ممتاز",
  "مراقب",
  "نائب مدير إدارة",
  "مدير إدارة",
  "نائب مدير عام",
  "مدير عام",
  "نائب مدير ادارة"
]
export const groups = [
  "ادارة المشروعات PMO",
  "استراتيجية وحوكمه تكنولوجيا المعلومات",
  "الاستثمارات",
  "الامن",
  "الامن السيبرانى",
  "البحوث",
  "التجزئة المصرفية ( مركز رئيسى )",
  "التخطيط الاستراتيجى",
  "التسويق والاتصال الخارجي",
  "التنمية المجتمعية",
  "الخزانة وأسواق المال",
  "الدعم الإداري",
  "الشركات الكبرى و القروض المشتركة",
  "المجموعة القانونية",
  "المجموعة المالية",
  "المشروعات الصغيرة والمتوسطة",
  "المشروعات والمنشأت العقارية",
  "المؤسسات المالية",
  "انظمة المعلومات و البنية التحتية",
  "تكنولوجيا المعلومات و التطبيقات",
  "تنفيذ ومتابعة الائتمان و الاستعلامات",
  "قطاع الرقابة الداخلية",
  "مجموعة الالتزام المصرفي والحوكمه المؤسسية",
  "مجموعة التدقيق الداخلي والتفتيش",
  "مجموعة العمليات",
  "مجموعة الفروع",
  "مجموعة الموارد البشرية",
  "مجموعة إجراءات التشغيل المعيارية",
  "مخاطر  الائتمان المصرفي للشركات الكبرى",
  "مخاطر التجزئة المصرفية للافراد",
  "مخاطر التشغيل",
  "مخاطر السوق",
  "مخاطر المشروعات الصغيرة والمتوسطة",
  "مخاطر المؤسسات المالية و الدول و التمويل المستدام",
  "مخاطر مشروعات الشمول المالى",
  "معالجة و إعادة هيكلة الديون الغير منتظمة"
]
export const units = [
  "ادارة المشروعات PMO",
  "استراتيجية وحوكمه تكنولوجيا المعلومات",
  "الاستثمارات",
  "الحوكمة والرقابة علي اعمال الاستثمارات وامناء الاستثمار",
  "أمناء الاستثمار",
  "الامن",
  "الامن السيبرانى",
  "البحوث",
  "التخطيط والتحليل والموازنة",
  "الخدمات المصرفية الرقمية",
  "القنوات البديلة",
  "المبيعات",
  "المنتجات و الشمول المالي",
  "خدمة العملاء الهاتفية",
  "قطاع ضمان الجودة للفروع",
  "وحدة تطوير الإجراءات",
  "التخطيط الاستراتيجى",
  "الاتصال التسويقي",
  "الإدارة المالية",
  "التسويق الالكترونى و الرعاية",
  "العلاقات العامة",
  "التنمية المجتمعية",
  "مجموعة الخزانة",
  "مجموعة أسواق المال وخدمات أمناء الحفظ",
  "الامدادات اللوجيستية",
  "التأمين المركزى",
  "الحسابات و التعاقدات",
  "الصيانة وإدارة المنشآت",
  "المصايف والرحلات - خدمات الفندقة و المطاعم",
  "إدارة المخازن و المزادات",
  "الشركات الكبرى",
  "القروض المشتركة",
  "تمويل الشركات المتوسطة",
  "المجموعة القانونية",
  "المجموعة المالية",
  "برامج التمويل والشراكات المحلية",
  "دعم شرائح عملاء SME",
  "قطاع التخطيط والتطوير",
  "قطاع تنمية الاعمال",
  "متابعة ائتمان SME(الفروع والمناطق)",
  "المشروعات ومراقبة التنفيذ",
  "الخدمات المالية الدولية",
  "المؤسسات المالية",
  "تقييم وتحليل المؤسسات المالية",
  "انظمة المعلومات و البنية التحتية",
  "تكنولوجيا المعلومات و التطبيقات",
  "الاستعلامات",
  "تنفيذ ومتابعة الائتمان",
  "قطاع الرقابة الداخلية",
  "مجموعة الالتزام المصرفي والحوكمه المؤسسية",
  "التدقيق على اعمال الائتمان والاستثمارات والتجزئه",
  "التدقيق على المركز الرئيسي والعمليات المركزية",
  "الجودة والتقارير والدعم الإداري والمتابعة والتنسيق",
  "التدقيق على ائتمان المشروعات الصغيره والمتوسطة",
  "التدقيق والتقتيش على اعمال نظم المعلومات",
  "التفتيش",
  "قطاع التدقيق على الفروع والمناطق",
  "الحوالات وتحصيل الشيكات",
  "دعم العمليات",
  "عمليات اعمال الخزانة والمؤسسات المالية",
  "عمليات الشركات",
  "عمليات الشركات قطاعات الرقابة",
  "عمليات تمويل التجارة/الاعتمادات المستندية",
  "عمليات حسابات العملاء",
  "عمليات قروض التجزئة",
  "مركز البطاقات ونظم الدفع الالكترونية",
  "ودائع العملاء",
  "التللرات والخزينة",
  "العمليات",
  "المراجعة والالتزام",
  "تللرات البلاتينيوم",
  "خدمة العملاء والاستقبال",
  "خدمة عملاء البلاتينيوم",
  "مديري الفروع",
  "التوجيه والقياس",
  "قطاع ادارة الاداء",
  "قطاع ادارة الكفاءات",
  "قطاع استقطاب الكفاءات",
  "قطاع الاتصال الداخلى",
  "قطاع الأجور  و المزايا",
  "قطاع التطوير المؤسسي",
  "قطاع الجودة والتقارير",
  "قطاع المعرفة والتطوير",
  "قطاع شركاء اعمال الموارد البشرية",
  "قطاع عمليات الموارد البشرية",
  "قطاع اجراءات التشغيل المعيارية لتكنولوجيا المعلومات",
  "مجموعة إجراءات التشغيل المعيارية",
  "قطاع السياسات الائتمانية",
  "قطاع إدارة المحفظة و مناهج قياس المخاطر",
  "مخاطر  الائتمان المصرفي للشركات الكبرى",
  "مخاطر التجزئة المصرفية للافراد",
  "قطاع المخاطر المعلوماتية والسيبرانية وخصوصية البيانات",
  "مخاطر التشغيل",
  "مخاطر السوق",
  "مخاطر المشروعات الصغيرة والمتوسطة",
  "مخاطر المؤسسات المالية و الدول و التمويل المستدام",
  "مخاطر مشروعات الشمول المالى",
  "معالجة و إعادة هيكلة الديون الغير منتظمة"
]
export const departments = {
  "ادارة المشروعات PMO": [
    "ادارة المشروعات PMO"
  ],
  "استراتيجية وحوكمه تكنولوجيا المعلومات": [
    "استراتيجية وحوكمه تكنولوجيا المعلومات"
  ],
  "الاستثمارات": [
    "الاستثمارات",
    "الحوكمة والرقابة علي اعمال الاستثمارات وامناء الاستثمار",
    "أمناء الاستثمار"
  ],
  "الامن": [
    "الامن"
  ],
  "الامن السيبرانى": [
    "الامن السيبرانى"
  ],
  "البحوث": [
    "البحوث"
  ],
  "التجزئة المصرفية ( مركز رئيسى )": [
    "التخطيط والتحليل والموازنة",
    "الخدمات المصرفية الرقمية",
    "القنوات البديلة",
    "المبيعات",
    "المنتجات و الشمول المالي",
    "خدمة العملاء الهاتفية",
    "قطاع ضمان الجودة للفروع",
    "وحدة تطوير الإجراءات"
  ],
  "التخطيط الاستراتيجى": [
    "التخطيط الاستراتيجى"
  ],
  "التسويق والاتصال الخارجي": [
    "الاتصال التسويقي",
    "الإدارة المالية",
    "التسويق الالكترونى و الرعاية",
    "العلاقات العامة"
  ],
  "التنمية المجتمعية": [
    "التنمية المجتمعية"
  ],
  "الخزانة وأسواق المال": [
    "مجموعة الخزانة",
    "مجموعة أسواق المال وخدمات أمناء الحفظ"
  ],
  "الدعم الإداري": [
    "الامدادات اللوجيستية",
    "التأمين المركزى",
    "الحسابات و التعاقدات",
    "الصيانة وإدارة المنشآت",
    "المصايف والرحلات - خدمات الفندقة و المطاعم",
    "إدارة المخازن و المزادات"
  ],
  "الشركات الكبرى و القروض المشتركة": [
    "الشركات الكبرى",
    "القروض المشتركة",
    "تمويل الشركات المتوسطة"
  ],
  "المجموعة القانونية": [
    "المجموعة القانونية"
  ],
  "المجموعة المالية": [
    "المجموعة المالية"
  ],
  "المشروعات الصغيرة والمتوسطة": [
    "برامج التمويل والشراكات المحلية",
    "دعم شرائح عملاء SME",
    "قطاع التخطيط والتطوير",
    "قطاع تنمية الاعمال",
    "متابعة ائتمان SME(الفروع والمناطق)"
  ],
  "المشروعات والمنشأت العقارية": [
    "المشروعات ومراقبة التنفيذ"
  ],
  "المؤسسات المالية": [
    "الخدمات المالية الدولية",
    "المؤسسات المالية",
    "تقييم وتحليل المؤسسات المالية"
  ],
  "انظمة المعلومات و البنية التحتية": [
    "انظمة المعلومات و البنية التحتية"
  ],
  "تكنولوجيا المعلومات و التطبيقات": [
    "تكنولوجيا المعلومات و التطبيقات"
  ],
  "تنفيذ ومتابعة الائتمان و الاستعلامات": [
    "الاستعلامات",
    "تنفيذ ومتابعة الائتمان"
  ],
  "قطاع الرقابة الداخلية": [
    "قطاع الرقابة الداخلية"
  ],
  "مجموعة الالتزام المصرفي والحوكمه المؤسسية": [
    "مجموعة الالتزام المصرفي والحوكمه المؤسسية"
  ],
  "مجموعة التدقيق الداخلي والتفتيش": [
    "التدقيق على اعمال الائتمان والاستثمارات والتجزئه",
    "التدقيق على المركز الرئيسي والعمليات المركزية",
    "الجودة والتقارير والدعم الإداري والمتابعة والتنسيق",
    "التدقيق على ائتمان المشروعات الصغيره والمتوسطة",
    "التدقيق والتقتيش على اعمال نظم المعلومات",
    "التفتيش",
    "قطاع التدقيق على الفروع والمناطق"
  ],
  "مجموعة العمليات": [
    "الحوالات وتحصيل الشيكات",
    "دعم العمليات",
    "عمليات اعمال الخزانة والمؤسسات المالية",
    "عمليات الشركات",
    "عمليات الشركات قطاعات الرقابة",
    "عمليات تمويل التجارة/الاعتمادات المستندية",
    "عمليات حسابات العملاء",
    "عمليات قروض التجزئة",
    "مركز البطاقات ونظم الدفع الالكترونية",
    "ودائع العملاء"
  ],
  "مجموعة الفروع": [
    "التللرات والخزينة",
    "العمليات",
    "المراجعة والالتزام",
    "تللرات البلاتينيوم",
    "خدمة العملاء والاستقبال",
    "خدمة عملاء البلاتينيوم",
    "مديري الفروع"
  ],
  "مجموعة الموارد البشرية": [
    "التوجيه والقياس",
    "قطاع ادارة الاداء",
    "قطاع ادارة الكفاءات",
    "قطاع استقطاب الكفاءات",
    "قطاع الاتصال الداخلى",
    "قطاع الأجور  و المزايا",
    "قطاع التطوير المؤسسي",
    "قطاع الجودة والتقارير",
    "قطاع المعرفة والتطوير",
    "قطاع شركاء اعمال الموارد البشرية",
    "قطاع عمليات الموارد البشرية"
  ],
  "مجموعة إجراءات التشغيل المعيارية": [
    "قطاع اجراءات التشغيل المعيارية لتكنولوجيا المعلومات",
    "مجموعة إجراءات التشغيل المعيارية"
  ],
  "مخاطر  الائتمان المصرفي للشركات الكبرى": [
    "قطاع السياسات الائتمانية",
    "قطاع إدارة المحفظة و مناهج قياس المخاطر",
    "مخاطر  الائتمان المصرفي للشركات الكبرى"
  ],
  "مخاطر التجزئة المصرفية للافراد": [
    "مخاطر التجزئة المصرفية للافراد"
  ],
  "مخاطر التشغيل": [
    "قطاع المخاطر المعلوماتية والسيبرانية وخصوصية البيانات",
    "مخاطر التشغيل"
  ],
  "مخاطر السوق": [
    "مخاطر السوق"
  ],
  "مخاطر المشروعات الصغيرة والمتوسطة": [
    "مخاطر المشروعات الصغيرة والمتوسطة"
  ],
  "مخاطر المؤسسات المالية و الدول و التمويل المستدام": [
    "مخاطر المؤسسات المالية و الدول و التمويل المستدام"
  ],
  "مخاطر مشروعات الشمول المالى": [
    "مخاطر مشروعات الشمول المالى"
  ],
  "معالجة و إعادة هيكلة الديون الغير منتظمة": [
    "معالجة و إعادة هيكلة الديون الغير منتظمة"
  ]
}