const group = [
    " الالتزام المصرفي والحوكمه المؤسسيه",
    " تنفيذ ومتابعة الديون",
    "Audit",
    "Data Center",
    "General",
    "Operation",
    "Risk",
    "SME",
    "Treasury",
    "إجراءات التشغيل المعياريه",
    "إجراءات التشغيل المعياريه لتكنولوجيا المعلومات",
    "اداره المشروعات",
    "الاستثمارات",
    "الامن",
    "الانظمة الرئيسية   - تطبيقات القروض والضمانات والمعاملات الاسلامية",
    "الانظمة الرئيسية -  تطبيقات اعمال التجارة",
    "تحليل البيانات والبرامج الوسيطة - تحليل البيانات"
] 