/**
 الدعم الإداري
المنتجات و المبيعات
الخدمات المصرفية الرقمية
ضمان الجودة
مجموعة الموارد البشرية
General

الامن
Risk
تنفيذ ومتابعة الديون
مجموعة معالجة و إعادة هيكلة الديون الغير منتظمة
مخاطر المؤسسات المالية
تمويل الشركات الكبرى
SME
فروع
Treasury
المؤسسات المالية
الاستثمارات
الرقابه الداخليه
Audit
إجراءات التشغيل المعياريه
الالتزام المصرفي والحوكمه المؤسسيه
المجموعه القانونيه
Operation

اداره المشروعات
إجراءات التشغيل المعياريه لتكنولوجيا المعلومات
امن المعلومات
التدقيق و التقتيش على اعمال نظم المعلومات
مخاطر تشغيل المعلومات
حوكمه تكنولوجيا المعلومات
البحوث
الماليه
التخطيط الاستراتيجي
انظمه المعلومات و البنيه التحتيه
البنية التحيتة
التحديثات وادارة خدمات وتامين انظمة مايكروسفت
الحاسبات و نظم التشغيل ووحدات التخزين
الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات
الدعم الفنى للتطبيقات و قواعد البيانات
الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات
 


رقابة و تطوير و ادارة خدمات نظم المعلومات
مراكز التشغيل
سرية المعلومات ومواجهة المخاطر
Data Center
الشبكات و الاتصالات
الدعم الفني لماكينات الصارف الالى
هندسة انظمة الارشفه وهندسة تدفق العمليات
التصميمات والمخططات الهندسية
تكنولوجيا المعلومات و التطبيقات
المراقبة والسرية - مراقبة الانظمة
لمراقبة والسرية - مراكز الدعم الفنى والطوارىء


الانظمة الرئيسية - تطبيقات القروض والضمانات والمعاملات الاسلامية
الانظمة الرئيسية - تطبيقات اعمال التجارة
الانظمة الرئيسية - تطبيقات البيانات الاساسية والخصوم
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Production Support TEAM
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Implementation Team المراقبة والسرية - مكتب الخدمة وادارة الاحداث
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم ERP ADMIN TEAM تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم
تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Implementation Team تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم Implementation Team
"تحليل البيانات والبرامج الوسيطة - تحليل البيانات تحليل البيانات والبرامج الوسيطة - قنوات التوزيع الداخلية"""
البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة
لبرامج المحيطة والمعاملات الرقمية - التطبيق والدعم ERP ADMIN TEAM
البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقميةEbanking Support
البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Dev. – Web
البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Dev. – Web / لبرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Quality Control
لبرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Quality Control
المراقبة والسرية - سرية التطبيقات
المراقبة والسرية - مكتب الخدمة وادارة الاحداث
تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم
تحليل البيانات والبرامج الوسيطة - تحليل البيانات
*/

// array of comment lines previous 
const Arra = [
    "الدعم الإداري",
    "المنتجات و المبيعات",
    "الخدمات المصرفية الرقمية",
    "ضمان الجودة",
    "مجموعة الموارد البشرية",
    "General",
    "الامن",
    "Risk",
    "تنفيذ ومتابعة الديون",
    "مجموعة معالجة و إعادة هيكلة الديون الغير منتظمة",
    "مخاطر المؤسسات المالية",
    "تمويل الشركات الكبرى",
    "SME",
    "فروع",
    "Treasury",
    "المؤسسات المالية",
    "الاستثمارات",
    "الرقابه الداخليه",
    "Audit",
    "إجراءات التشغيل المعياريه",
    "الالتزام المصرفي والحوكمه المؤسسيه",
    "المجموعه القانونيه",
    "Operation",
    "اداره المشروعات",
    "إجراءات التشغيل المعياريه لتكنولوجيا المعلومات",
    "امن المعلومات",
    "التدقيق و التقتيش على اعمال نظم المعلومات",
    "مخاطر تشغيل المعلومات",
    "حوكمه تكنولوجيا المعلومات",
    "البحوث",
    "الماليه",
    "التخطيط الاستراتيجي",
    "انظمه المعلومات و البنيه التحتيه",
    "البنية التحيتة",
    "التحديثات وادارة خدمات وتامين انظمة مايكروسفت",
    "الحاسبات و نظم التشغيل ووحدات التخزين",
    "الحاسبات ونظم ومراكز التشغيل والتطبيقات وقواعد البيانات",
    "الدعم الفنى للتطبيقات و قواعد البيانات",
    "الدعم الفني لقنوات التوزيع الخارجية و انظمة البطاقات",
    "رقابة و تطوير و ادارة خدمات نظم المعلومات",
    "مراكز التشغيل",
    "سرية المعلومات ومواجهة المخاطر",
    "Data Center",
    "الشبكات و الاتصالات",
    "الدعم الفني لماكينات الصارف الالى",
    "هندسة انظمة الارشفه وهندسة تدفق العمليات",
    "التصميمات والمخططات الهندسية",
    "تكنولوجيا المعلومات و التطبيقات",
    "المراقبة والسرية ",
    " مراقبة الانظمة",
    "لمراقبة والسرية ",
    "مراكز الدعم الفنى والطوارىء",
    "المراقبة والسرية - سرية التطبيقات",
    "المراقبة والسرية - مكتب الخدمة وادارة الاحداث",
    "تحليل البيانات والبرامج الوسيطة - البرامج الوسيطة و بطاقات الخصم",
    "تحليل البيانات والبرامج الوسيطة - تحليل البيانات",
    "البرامج المحيطة والمعاملات الرقمية - البرامج المحيطة",
    "البرامج المحيطة والمعاملات الرقمية - التطبيق والدعم",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Dev. – Web",
    "البرامج المحيطة والمعاملات الرقمية - المعاملات البنكية الرقمية Quality Control"
];

    




    
    
